function translateToHindiFromBengali() {
    const inputText = document.getElementById("inputText").value;

    const translations = {
        '{{টেমপ্লেট:বই উদ্ধৃতি': '{{साँचा:Cite book',
        '{{টেমপ্লেট:ওয়েব উদ্ধৃতি': '{{साँचा:Cite web',
        '{{টেমপ্লেট:সংবাদ উদ্ধৃতি': '{{साँचा:Cite news',
        '{{টেমপ্লেট:জার্নাল উদ্ধৃতি': '{{साँचा:Cite journal',
        'তারিখ': 'तारीख',
        'সংগ্রহের তারিখ': 'पहुंच तिथि',
        'আর্কাইভের তারিখ': 'आर्काइव तिथि',
        'ওয়েবসাইট': 'वेबसाइट',
        'শিরোনাম': 'शीर्षक',
        'শেষাংশ': 'अंतिम',
        'প্রথমাংশ': 'प्रथम',
        'সম্পাদক': 'संपादक',
        'পাতা': 'पृष्ठ',
        'পাতাসমূহ': 'पृष्ठों',
        'লেখক': 'लेखक',
        'অবস্থান': 'स्थान',
        'আইএসবিএন': 'आईएसबीएन',
        'এলসিসিএন': 'एलसीसीएन',
        'ভাষা': 'भाषा',
        'উক্তি': 'उद्धरण',
        'অবস্থা': 'स्थिति',
        'কার্যকর': 'सक्रिय',
        '=অকার্যকর': '= मृत',
        'এজেন্সি': 'एजेंसी',
        'প্রকাশক': 'प्रकाशक',
        'অনুবাদিত': 'अनुवादित',
        'কর্ম': 'कार्य',
        'সংস্করণ': 'संस्करण',
        '১': '१',
        '২': '२',
        '৩': '३',
        '৪': '४',
        '৫': '५',
        '৬': '६',
        '৭': '७',
        '৮': '८',
        '৯': '९',
        '০': '०',
        'জানুয়ারি': 'जनवरी',
        'ফেব্রুয়ারি': 'फरवरी',
        'মার্চ': 'मार्च',
        'এপ্রিল': 'अप्रैल',
        'মে': 'मई',
        'জুন': 'जून',
        'জুলাই': 'जुलाई',
        'আগস্ট': 'अगस्त',
        'সেপ্টেম্বর': 'सितंबर',
        'অক্টোবর': 'अक्टूबर',
        'নভেম্বর': 'नवंबर',
        'ডিসেম্বর': 'दिसंबर',
        'ইউআরএল': 'यूआरएल'
    };

    let outputText = inputText;

    for (const [bnTemplate, hiTemplate] of Object.entries(translations)) {
        const regex = new RegExp(bnTemplate, 'gi');
        outputText = outputText.replace(regex, hiTemplate);
    }

    document.getElementById("outputText").value = outputText;
}