function translateToBengaliTemplate() {
    const inputText = document.getElementById("inputText").value;

    const translations = {
        '{{साँचा:Cite book': '{{টেমপ্লেট:বই উদ্ধৃতি',
        '{{साँचा:Cite web': '{{টেমপ্লেট:ওয়েব উদ্ধৃতি',
        '{{साँचा:Cite news': '{{টেমপ্লেট:সংবাদ উদ্ধৃতি',
        '{{साँचा:Cite journal': '{{টেমপ্লেট:জার্নাল উদ্ধৃতি',
        'तारीख': 'তারিখ',
        'पहुंच तिथि': 'সংগ্রহের তারিখ',
        'आर्काइव तिथि': 'আর্কাইভের তারিখ',
        'वेबसाइट': 'ওয়েবসাইট',
        'शीर्षक': 'শিরোনাম',
        'अंतिम': 'শেষাংশ',
        'प्रथम': 'প্রথমাংশ',
        'संपादक': 'সম্পাদক',
        'पृष्ठ': 'পাতা',
        'पृष्ठों': 'পাতাসমূহ',
        'लेखक': 'লেখক',
        'स्थान': 'অবস্থান',
        'आईएसबीएन': 'আইএসবিএন',
        'एलसीसीएन': 'এলসিসিএন',
        'भाषा': 'ভাষা',
        'उद्धरण': 'উক্তি',
        'स्थिति': 'অবস্থা',
        'सक्रिय': 'কার্যকর',
        '= मृत': '=অকার্যকর',
        'एजेंसी': 'এজেন্সি',
        'प्रकाशक': 'প্রকাশক',
        'अनुवादित': 'অনুবাদিত',
        'कार्य': 'কর্ম',
        'संस्करण': 'সংস্করণ',
        '१': '১',
        '२': '২',
        '३': '৩',
        '४': '৪',
        '५': '৫',
        '६': '৬',
        '७': '৭',
        '८': '৮',
        '९': '৯',
        '०': '০',
        'जनवरी': 'জানুয়ারি',
        'फरवरी': 'ফেব্রুয়ারি',
        'मार्च': 'মার্চ',
        'अप्रैल': 'এপ্রিল',
        'मई': 'মে',
        'जून': 'জুন',
        'जुलाई': 'জুলাই',
        'अगस्त': 'আগস্ট',
        'सितंबर': 'সেপ্টেম্বর',
        'अक्टूबर': 'অক্টোবর',
        'नवंबर': 'নভেম্বর',
        'दिसंबर': 'ডিসেম্বর',
        'यूआरएल': 'ইউআরএল'
    };

    let outputText = inputText;

    for (const [hiTemplate, bnTemplate] of Object.entries(translations)) {
        const regex = new RegExp(hiTemplate, 'gi');
        outputText = outputText.replace(regex, bnTemplate);
    }

    document.getElementById("outputText").value = outputText;
}